from aiogram import Router, types, F
from aiogram.filters import Command

router = Router()

@router.message(F.text=='ℹ️ Помощь')
@router.message(Command('help'))
async def cmd_help(message: types.Message):
    """Обработчик комманды /help"""
    help_text = (
        '**Помощь по использованию бота:**\n\n'
        '**Основные функции:**\n'
        '**🔐 Сгенерировать пароль** - создает новый безопасный пароль\n'
        '**📋 Мои пароли** - показывает все сохраненные пароли'
        '**💾 Сохранить пароль** - сохраняет пароль для сайта\n'
        '**❌ Удалить пароль** - удаляет пароль для указанного сайта\n\n'
        '**Комманды:**\n'
        '/start - Начать работу\n'
        '/help - Показать эту справку\n'
        '/generate - Сгенерировать пароль\n'
        '/list - Показать все пароли\n\n'
        '**Форматы сообщений:\n'
        'Для сохранения пароля: "сайт:пароль"\n'
        'Пример: "gmail.com:QWERTY123"\n\n'
        '⚠️ **Безопасность**:\n'
        '• Пароли хранятся в зашифрованом виде\n'
        '• Регулярно делайте бэкапы\n'
        '• Не передавайте пароли третьим лицам!'
    )
    await message.answer(help_text, parse_mode="Markdown")
